<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ea98ebec7da64ea65d4b436b5c9b0cde0ef68b3df896c9099659528edca3ba92","plan_job_ref":"Job Create terraform plan #41 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7227768766","plan_hash":"c3e00d74c743be8d9ae75fe508a4b4d48623a9c71916b59b6300b52e73ee2a59","plan_text_format":"text","version":"1.38.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:950012193416:service/co-boomi-atom-cluster/co-boomi-atom-service"
        name                               = "co-boomi-atom-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:10" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "*************" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1702508765622397800" -> "1702680083868269000"
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #41](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/7227768766)